Ran Apply for dir: `.` workspace: `production`

**Apply Error**
<details><summary>Show Output</summary>

```
running "/usr/bin/terraform apply -input=false -no-color" in "/home/ubuntu/.atlantis/repos/1995navinkumar/terraform/44/production": exit status 1
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/sknk/production/runs/run-4BZPmroVgu8AZfET

Waiting for the plan to start...

Terraform v1.6.1
on linux_amd64
Initializing plugins and modules...
module.kubernetes.module.postgresql.kubernetes_config_map.sql_scripts: Refreshing state... [id=postgresql/sql-scripts]
module.kubernetes.module.grafana.helm_release.grafana: Refreshing state... [id=grafana]
module.kubernetes.module.test-server.helm_release.test-server: Refreshing state... [id=test-server]
module.kubernetes.module.react-starter-vite.helm_release.react-starter-vite: Refreshing state... [id=react-starter-vite]
module.kubernetes.module.healthvue.helm_release.healthvue: Refreshing state... [id=healthvue]
module.kubernetes.module.kacheri.helm_release.kacheri: Refreshing state... [id=kacheri]
module.kubernetes.module.storage.kubernetes_manifest.local-storage-class: Refreshing state...
module.kubernetes.module.storage.kubernetes_manifest.persistent-volume-3Gi_3: Refreshing state...
module.kubernetes.module.storage.kubernetes_manifest.persistent-volume-3Gi_1: Refreshing state...
module.kubernetes.module.minio.kubernetes_manifest.minio-namespace: Refreshing state...
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-namespace: Refreshing state...
module.kubernetes.module.storage.kubernetes_manifest.persistent-volume-3Gi_2: Refreshing state...
module.kubernetes.module.traefik.helm_release.traefik: Refreshing state... [id=traefik]
module.kubernetes.module.whoami.helm_release.whoami: Refreshing state... [id=whoami]
module.kubernetes.module.healthvue-server.helm_release.healthvue-server: Refreshing state... [id=healthvue-server]
module.kubernetes.module.grafana.helm_release.grafana-agent: Refreshing state... [id=grafana-agent]
module.kubernetes.module.postgresql.helm_release.postgresql: Refreshing state... [id=postgresql]
module.kubernetes.module.grafana.helm_release.promtail: Refreshing state... [id=promtail]
module.kubernetes.module.grafana.helm_release.loki: Refreshing state... [id=loki]
module.kubernetes.module.minio.helm_release.minio: Refreshing state... [id=minio]
module.kubernetes.module.prometheus.helm_release.prometheus: Refreshing state... [id=prometheus]
module.kubernetes.module.grafana.kubernetes_manifest.grafana-faro-svc: Refreshing state...
module.kubernetes.module.grafana.kubernetes_manifest.grafana-faro-middleware: Refreshing state...
module.kubernetes.module.grafana.kubernetes_manifest.grafana-agent-ingress: Refreshing state...
module.kubernetes.module.postgresql.helm_release.pgadmin: Refreshing state... [id=pgadmin]
module.kubernetes.module.postgresql.kubernetes_job.run_sql_scripts: Refreshing state... [id=postgresql/run-sql-scripts]
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-ingress-middleware: Refreshing state...
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-ingress: Refreshing state...
module.kubernetes.module.storage.kubernetes_manifest.persistent-volume-3Gi_1: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.kubernetes.module.minio.helm_release.minio must be replaced
-/+ resource "helm_release" "minio" {
      ~ id                         = "minio" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version = "2024.7.4"
              - chart       = "minio"
              - name        = "minio"
              - namespace   = "default"
              - revision    = 1
              - values      = jsonencode(
                    {
                      - auth              = {
                          - rootPassword = "admin"
                        }
                      - namespaceOverride = "minio"
                      - persistence       = {
                          - size         = "3Gi"
                          - storageClass = "local-storage-class"
                        }
                      - volumePermissions = {
                          - enabled = true
                        }
                    }
                )
              - version     = "14.6.19"
            },
        ] -> (known after apply)
        name                       = "minio"
      ~ status                     = "failed" -> "deployed"
      ~ values                     = [
          - <<-EOT
                namespaceOverride: minio
                auth:
                  rootPassword : admin
                persistence:
                  storageClass: local-storage-class
                  size: 3Gi
                volumePermissions:
                  enabled: true
            EOT,
          + <<-EOT
                namespaceOverride: minio
                auth:
                  rootPassword : minioadmin
                persistence:
                  storageClass: local-storage-class
                  size: 3Gi
                volumePermissions:
                  enabled: true
            EOT,
        ]
      ~ version                    = "14.6.19" -> (known after apply)
        # (24 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Error: Cannot confirm apply due to -input=false. Please handle run confirmation in the UI.

```
</details>